In [1]:
import sqlalchemy as db
import pandas as pd
params = {
    'host': '34.217.89.93',  # Replace with your own database IP Address.
    'user': 'ubuntu',
    'port': 5432
}
connection_string = f'postgres://ubuntu:{params["host"]}@{params["host"]}:{params["port"]}/baseball'
engine = db.create_engine(connection_string)
connection = engine.connect()

In [2]:
query = 'SELECT fielding."playerID" AS "playerID", min(fielding."yearID") as "FirstYearPlayed", max(fielding."yearID") as "LastYearPlayed" FROM fielding GROUP BY fielding."playerID"'
pd.read_sql_query(query, connection)

        playerID  FirstYearPlayed  LastYearPlayed
0      jacobar01             1939            1939
1      kriegbi01             1884            1887
2      peppela01             1954            1957
3       loesbi01             1950            1961
4      cathete01             1912            1915
...          ...              ...             ...
17976   halldr01             1986            1990
17977  peppedo01             1966            1966
17978  sembeca01             1965            1970
17979   zinnfr01             1888            1888
17980  gladdda01             1983            1993

[17981 rows x 3 columns]